---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorPosition
source: html/05ee033f-02ef-5eee-7fee-fc861df2d8dc.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.VectorPosition Property

Vector position.

## Syntax (C#)
```csharp
public AnalysisDisplayStyleVectorPosition VectorPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration